       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       AUTHOR. CASCADE.
       DATE-WRITTEN. 2025-05-10.
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. X86-64.
       OBJECT-COMPUTER. X86-64.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GREETING PIC X(20) VALUE "HELLO, WORLD!".
       
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY GREETING.
           STOP RUN.